cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addVoiceMailProfile.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addVoiceMailProfile sequence="?">
         <voiceMailProfile>
            <name>CUC-VM-Profile</name>
            <description>CUC-VM-Profile</description>
            <isDefault>true</isDefault>
         </voiceMailProfile>
      </ns:addVoiceMailProfile>
   </soapenv:Body>
</soapenv:Envelope>